Revit 2027 API
PointCloudColorSettings(PointCloudColorMode) Constructor
 Constructs color settings object with default color for given color mode.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorSettings(
	PointCloudColorMode mode
)
Public Sub New (
	mode As PointCloudColorMode
)
public:
PointCloudColorSettings(
	PointCloudColorMode mode
)
new :
        mode : PointCloudColorMode -> PointCloudColorSettings
Parameters
mode PointCloudColorMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace